#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnnualRefundTokenUI

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "CommonUI_classes.hpp"
#include "AnnualRefundTokenUI_structs.hpp"


namespace SDK
{

// Class AnnualRefundTokenUI.FortAnnualRefundTokenData
// 0x0028 (0x04F0 - 0x04C8)
class UFortAnnualRefundTokenData final : public UFortGameFeatureData
{
public:
	TSoftClassPtr<class UClass>                   PurchaseHistoryScreenClass;                        // 0x04C8(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAnnualRefundTokenData">();
	}
	static class UFortAnnualRefundTokenData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnnualRefundTokenData>();
	}
};

// Class AnnualRefundTokenUI.FortAnnualRefundTicket
// 0x0008 (0x0268 - 0x0260)
class UFortAnnualRefundTicket final : public UUserWidget
{
public:
	class UCommonTextBlock*                       Text_AvailableDate;                                // 0x0260(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnPlayLockingAnimation();
	void OnUpdateAvailableState(const bool bIsAvailable);
	void OnUpdatePendingState(const bool bIsPending);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAnnualRefundTicket">();
	}
	static class UFortAnnualRefundTicket* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnnualRefundTicket>();
	}
};

// Class AnnualRefundTokenUI.FortPurchaseHistoryEntry
// 0x0030 (0x0C00 - 0x0BD0)
class UFortPurchaseHistoryEntry final : public UCommonButtonBase
{
public:
	uint8                                         Pad_BD0[0x8];                                      // 0x0BD0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortCosmeticItemCard>      ItemCardClass;                                     // 0x0BD8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CardWidthOverride;                                 // 0x0BE0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_BE4[0x4];                                      // 0x0BE4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_Name;                                         // 0x0BE8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class FString>                         LootEntryItemTypesToExclude;                       // 0x0BF0(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)

public:
	void OnSetHistory(bool bHasBeenRefunded, bool bIsTokenlessRefund, bool bPlayerHasTokens);
	void SetPurchaseText(const class FText& PurchaseText, bool bHasBeenRefunded);
	void SetupItemCard(const class UFortCosmeticItemCard* ItemCard, const class UFortItem* Item);
	void UpdateItemList(const TArray<class UFortCosmeticItemCard*>& ItemCards);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPurchaseHistoryEntry">();
	}
	static class UFortPurchaseHistoryEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPurchaseHistoryEntry>();
	}
};

// Class AnnualRefundTokenUI.FortPurchaseHistoryListView
// 0x00E0 (0x0300 - 0x0220)
class UFortPurchaseHistoryListView final : public UListViewBase
{
public:
	uint8                                         Pad_220[0xE0];                                     // 0x0220(0x00E0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPurchaseHistoryListView">();
	}
	static class UFortPurchaseHistoryListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPurchaseHistoryListView>();
	}
};

// Class AnnualRefundTokenUI.ReturnReasonDataWrapper
// 0x0018 (0x0040 - 0x0028)
class UReturnReasonDataWrapper final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ReturnReasonDataWrapper">();
	}
	static class UReturnReasonDataWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReturnReasonDataWrapper>();
	}
};

// Class AnnualRefundTokenUI.FortPurchaseHistoryScreen
// 0x0120 (0x0468 - 0x0348)
class UFortPurchaseHistoryScreen final : public UCommonActivatableWidget
{
public:
	struct FDataTableRowHandle                    BackAction;                                        // 0x0348(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortRefundConfirmation>    RefundConfirmationClass;                           // 0x0358(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonGroupBase*                 TabButtonGroup;                                    // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonActivatableWidgetSwitcher*       Switcher_ItemList;                                 // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinRefundSubmissionDelay;                          // 0x0370(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MaxRefundSubmissionDelay;                          // 0x0374(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class FText>                           ReturnReasons;                                     // 0x0378(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class UReturnReasonDataWrapper*>       WrapperArray;                                      // 0x0388(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_398[0x10];                                     // 0x0398(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortItemDefinition*>            SelectedItemDefs;                                  // 0x03A8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3B8[0x30];                                     // 0x03B8(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPurchaseHistoryListView*           ListView_Purchases;                                // 0x03E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonListView*                        ListView_Reasons;                                  // 0x03F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_RequestRefund;                              // 0x03F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_CloseMobile;                                // 0x0400(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_PostApproval;                               // 0x0408(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_Desc;                                         // 0x0410(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_RefundCount;                                  // 0x0418(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ResultTitle;                                  // 0x0420(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ResultDesc;                                   // 0x0428(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ResultMtxMsg;                                 // 0x0430(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_RefundValue;                                  // 0x0438(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_WarningMsg;                               // 0x0440(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScrollBox*                             ScrollBox_ItemsToReturn;                           // 0x0448(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAnnualRefundTicket*                RefundTicket_Left;                                 // 0x0450(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAnnualRefundTicket*                RefundTicket_Center;                               // 0x0458(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAnnualRefundTicket*                RefundTicket_Right;                                // 0x0460(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandlePreviousStepAction();
	void HandleTabButtonClicked(EPurchaseReturnStep ClickedStep);
	void OnBeginRefundSubmission();
	void OnEndRefundSubmission();
	void OnItemRefresh(const struct FMtxPurchaseHistory& PurchaseHistory);
	void OnNoPurchasesAvailable();
	void OnOpenSubmitRequest(bool bIsSelectionTokenlessRefundable);
	void OnPopulateView(EPurchaseReturnStep CurrentStep);
	void UpdateItemList(const TArray<class UCommonTextBlock*>& ItemsToReturn);

	EPurchaseReturnStep GetCurrentStep() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPurchaseHistoryScreen">();
	}
	static class UFortPurchaseHistoryScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPurchaseHistoryScreen>();
	}
};

// Class AnnualRefundTokenUI.FortRefundConfirmation
// 0x0058 (0x03A0 - 0x0348)
class UFortRefundConfirmation final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_348[0x10];                                     // 0x0348(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_RefundsRemaining;                             // 0x0358(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_RefundCount;                                  // 0x0360(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_AreYouSure;                                   // 0x0368(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Yes;                                        // 0x0370(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_No;                                         // 0x0378(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_CloseMobile;                                // 0x0380(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAnnualRefundTicket*                RefundTicket_Left;                                 // 0x0388(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAnnualRefundTicket*                RefundTicket_Center;                               // 0x0390(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAnnualRefundTicket*                RefundTicket_Right;                                // 0x0398(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortRefundConfirmation">();
	}
	static class UFortRefundConfirmation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortRefundConfirmation>();
	}
};

// Class AnnualRefundTokenUI.FortReturnReasonEntry
// 0x0018 (0x0BE8 - 0x0BD0)
class UFortReturnReasonEntry final : public UCommonButtonBase
{
public:
	uint8                                         Pad_BD0[0x8];                                      // 0x0BD0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                InternalData;                                      // 0x0BD8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_Name;                                         // 0x0BE0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortReturnReasonEntry">();
	}
	static class UFortReturnReasonEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortReturnReasonEntry>();
	}
};

}

