#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_PetrolWeapon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "B_Ranged_Generic_Athena_Deprecated_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_PetrolWeapon.B_PetrolWeapon_C
// 0x00F0 (0x1A60 - 0x1970)
class AB_PetrolWeapon_C final : public AB_Ranged_Generic_Athena_Deprecated_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_PetrolWeapon_C;                   // 0x1970(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        PourLoopSound;                                     // 0x1978(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        PourStopSound;                                     // 0x1980(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortSplatterSourceComponent*           FortSplatterSource;                                // 0x1988(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableAmmoMod;                                     // 0x1990(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1991[0x7];                                     // 0x1991(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_Petrol_Pickup_C*                   AttachedBGAActor;                                  // 0x1998(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	class FName                                   AttachSocket;                                      // 0x19A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AttachedBGAScale;                                  // 0x19A8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19B4[0xC];                                     // 0x19B4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             AttachedBGARelativeTransform;                      // 0x19C0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TScriptInterface<class IFortInventoryOwnerInterface> InventoryInterface;                         // 0x19F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGuid                                  InventoryGUID;                                     // 0x1A00(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_FuelLeaking;                                    // 0x1A10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         IsShootableWhileHeld;                              // 0x1A18(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AFortWeapon*                            WeaponReference;                                   // 0x1A40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowHUDKeyActions;                                 // 0x1A48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A49[0x3];                                     // 0x1A49(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Tag_InWindup;                                      // 0x1A4C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_PetrolWeapon(int32 EntryPoint);
	void ReplicateOnHolstered();
	void ReplicateOnUnholstered();
	void BGADestroyedWhileHeld();
	void UnbindHolsterEvents();
	void BindHolsterEvents();
	void OnUnholstered();
	void OnHolstered();
	void HUDKeyAction_Targeting(bool IsTargeting);
	void ReceiveBeginPlay();
	void K2_OnUnEquip();
	void OnUnEquip_Copy_();
	void OnStopWeaponFireFX();
	void OnEquip_Copy_();
	void UpdateAndAttachBGA();
	void OnWeaponAttached();
	void OnPlayWeaponFireFX(bool bPersistentFire, bool bSecondaryFire);
	void OnSpawnProjectile(class AFortProjectileBase* SpawnProjectile);
	void Removed_37103EFF43C9315C3003269E0216DE30();
	void Added_B93A41134252056323F976A22CCF45FB();
	void OnRep_AttachedBGAActor();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_PetrolWeapon_C">();
	}
	static class AB_PetrolWeapon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_PetrolWeapon_C>();
	}
};

}

