#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_SidewaysEncounter_EnvCoreSmall

#include "Basic.hpp"

#include "Enum_Athena_SidewaysEncounter_State_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_Athena_SidewaysEncounter_EnvCoreSmall.BGA_Athena_SidewaysEncounter_EnvCoreSmall_C
// 0x00B8 (0x0970 - 0x08B8)
class ABGA_Athena_SidewaysEncounter_EnvCoreSmall_C final : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   AudioGameplayVolume;                               // 0x08C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_SideWays_SurfaceSmoke_SM;                       // 0x08C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Sideways_SmokePillars;                          // 0x08D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_SideWays_Volume_InWorld;                        // 0x08D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CoreSystem;                                        // 0x08E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   EncounterStageVolume;                              // 0x08E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Grabber;                                           // 0x08F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        StingerAudio;                                      // 0x08F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAthenaSpecialActorComponent*           AthenaSpecialActor;                                // 0x0900(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        LoopingAudio;                                      // 0x0908(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   EncounterBubble;                                   // 0x0910(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      CoreOverlap;                                       // 0x0918(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x0920(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BubbleScale_Alpha_27E5418648942C9C9147B8A555D981A0; // 0x0928(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            BubbleScale__Direction_27E5418648942C9C9147B8A555D981A0; // 0x092C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92D[0x3];                                      // 0x092D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     BubbleScale;                                       // 0x0930(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_VolumeHalfHeightScale;                         // 0x0938(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          InstantStart;                                      // 0x0960(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          DisableWorldFX;                                    // 0x0961(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	Enum_Athena_SidewaysEncounter_State           EncounterState;                                    // 0x0962(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_963[0x5];                                      // 0x0963(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Music;                                             // 0x0968(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreSmall(int32 EntryPoint);
	void EncounterStateChangedBGA(Enum_Athena_SidewaysEncounter_State EncounterState_0);
	void ChangeCoreFX(int32 Stage);
	void CE_UpdateCoreFX_Stage3();
	void CE_UpdateCoreFX_Stage1();
	void CE_UpdateCoreFX_Stage2();
	void HandleReplayScrubComplete();
	void ScaleBubbleEvent(float StartScale, float EndScale);
	void UpdateLoopingAudioEvent(class USoundBase* Music_0);
	void UpdateLoopingAudio(class USoundBase* Music_0);
	void SpawnCosmeticEvent(const struct FGameplayTag& GameplayCueTag);
	void KillEvent();
	void ReceiveBeginPlay();
	void HideAndKill();
	void StartBubbleScaling(float StartScale, float EndScale);
	void BndEvt__CoreOverlap_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnReady_48653C3E4B324B38E5B0D9A18FBF7FF4(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void BubbleScale__UpdateFunc();
	void BubbleScale__FinishedFunc();
	bool ShouldDie(float Damage, class AController* EventInstigator, class AActor* DamageCauser);
	void GetSidewaysPlayspace(class ASmallSidewaysPlayspace_C** Playspace);
	void GetSidewaysEncounterComponent(class USmallSidewaysPlayspaceEncounterComponent_C** EncounterComponent);
	void OnRep_DisableWorldFX();
	void UpdateAGVScale(const struct FVector& NewScale);
	void Find_Encounter_Bubble_Child_Actor_Static_Mesh_Component(class UStaticMeshComponent** Bubble_Mesh);
	void OnRep_EncounterState();
	void OnRep_Music();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_Athena_SidewaysEncounter_EnvCoreSmall_C">();
	}
	static class ABGA_Athena_SidewaysEncounter_EnvCoreSmall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_Athena_SidewaysEncounter_EnvCoreSmall_C>();
	}
};

}

