#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LocalPlayerMannequin_Lobby

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function BP_LocalPlayerMannequin_Lobby.BP_LocalPlayerMannequin_Lobby_C.ExecuteUbergraph_BP_LocalPlayerMannequin_Lobby
// 0x0008 (0x0008 - 0x0000)
struct BP_LocalPlayerMannequin_Lobby_C_ExecuteUbergraph_BP_LocalPlayerMannequin_Lobby final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CacheLocalPlayerCosmetics_bFoundCosmeticsToCache; // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function BP_LocalPlayerMannequin_Lobby.BP_LocalPlayerMannequin_Lobby_C.CacheLocalPlayerCosmetics
// 0x0178 (0x0178 - 0x0000)
struct BP_LocalPlayerMannequin_Lobby_C_CacheLocalPlayerCosmetics final
{
public:
	bool                                          bFoundCosmeticsToCache;                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortAthenaLoadout                     CallFunc_GetLocalPlayerLoadout_ReturnValue;        // 0x0008(0x0150)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFrontEnd_PlayerController_C*           K2Node_DynamicCast_AsFront_End_Player_Controller;  // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

}

