#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS18_LandingPages

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BPS18_LandingPages.BPS18_LandingPages_C.ExecuteUbergraph_BPS18_LandingPages
// 0x00E0 (0x00E0 - 0x0000)
struct BPS18_LandingPages_C_ExecuteUbergraph_BPS18_LandingPages final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPS18_LandingPageButton_C*             K2Node_CustomEvent_Button_RewardOverview;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPS18_LandingPageButton_C*             K2Node_CustomEvent_Button_CharacterCustomizer;     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPS18_LandingPageButton_C*             K2Node_CustomEvent_Button_MysteryRewards;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPS18_LandingPageButton_C*             K2Node_CustomEvent_Button_BonusRewards;            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPS18_LandingPageButton_C*             K2Node_CustomEvent_Button_JoinSubscription;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPS18_LandingPage_SmallButton_C*       K2Node_CustomEvent_Button_BuyResources;            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPS18_LandingPage_SmallButton_C*       K2Node_CustomEvent_Button_GiftBattlePass;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPS18_LandingPage_SmallButton_C*       K2Node_CustomEvent_Button_BuyBattlePass;           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_7;               // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_6;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_5;               // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_4;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_3;               // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_BPComplete;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPS18_LandingPageButton_C*             K2Node_DynamicCast_AsBPS18_Landing_Page_Button;    // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPS18_LandingPageButton_C*             K2Node_DynamicCast_AsBPS18_Landing_Page_Button_1;  // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Level;                          // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bGiftingAllowed;                      // 0x00B8(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSubscriptionAllowed;                 // 0x00BC(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Delayed;                        // 0x00BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BF[0x1];                                       // 0x00BF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPS18_LandingPageButton_C*             K2Node_DynamicCast_AsBPS18_Landing_Page_Button_2;  // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPS18_LandingPageButton_C*             K2Node_DynamicCast_AsBPS18_Landing_Page_Button_3;  // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_SkinAcquired;                   // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function BPS18_LandingPages.BPS18_LandingPages_C.UpdateCustomizationSkinAcquired
// 0x0001 (0x0001 - 0x0000)
struct BPS18_LandingPages_C_UpdateCustomizationSkinAcquired final
{
public:
	bool                                          SkinAcquired;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function BPS18_LandingPages.BPS18_LandingPages_C.UpdateBonusPageDelay
// 0x0001 (0x0001 - 0x0000)
struct BPS18_LandingPages_C_UpdateBonusPageDelay final
{
public:
	bool                                          Delayed;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function BPS18_LandingPages.BPS18_LandingPages_C.OnBattlePassSubscriptionAllowed
// 0x0001 (0x0001 - 0x0000)
struct BPS18_LandingPages_C_OnBattlePassSubscriptionAllowed final
{
public:
	bool                                          bSubscriptionAllowed;                              // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function BPS18_LandingPages.BPS18_LandingPages_C.OnBattlePassGiftingAllowed
// 0x0001 (0x0001 - 0x0000)
struct BPS18_LandingPages_C_OnBattlePassGiftingAllowed final
{
public:
	bool                                          bGiftingAllowed;                                   // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function BPS18_LandingPages.BPS18_LandingPages_C.On Level Changed
// 0x0004 (0x0004 - 0x0000)
struct BPS18_LandingPages_C_On_Level_Changed final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPS18_LandingPages.BPS18_LandingPages_C.On BattlePass completed
// 0x0001 (0x0001 - 0x0000)
struct BPS18_LandingPages_C_On_BattlePass_completed final
{
public:
	bool                                          BPComplete;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function BPS18_LandingPages.BPS18_LandingPages_C.BndEvt__Button_GiftBattlePass_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPS18_LandingPages_C_BndEvt__Button_GiftBattlePass_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPS18_LandingPages.BPS18_LandingPages_C.BndEvt__Button_Quests_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPS18_LandingPages_C_BndEvt__Button_Quests_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPS18_LandingPages.BPS18_LandingPages_C.BndEvt__Button_BuyBattlePass_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPS18_LandingPages_C_BndEvt__Button_BuyBattlePass_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPS18_LandingPages.BPS18_LandingPages_C.BndEvt__Button_JoinSubscription_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPS18_LandingPages_C_BndEvt__Button_JoinSubscription_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPS18_LandingPages.BPS18_LandingPages_C.BndEvt__Button_BonusRewards_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPS18_LandingPages_C_BndEvt__Button_BonusRewards_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPS18_LandingPages.BPS18_LandingPages_C.BndEvt__Button_MysteryRewards_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPS18_LandingPages_C_BndEvt__Button_MysteryRewards_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPS18_LandingPages.BPS18_LandingPages_C.BndEvt__Button_CharacterCustomizer_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPS18_LandingPages_C_BndEvt__Button_CharacterCustomizer_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPS18_LandingPages.BPS18_LandingPages_C.BndEvt__Button_RewardOverview_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPS18_LandingPages_C_BndEvt__Button_RewardOverview_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPS18_LandingPages.BPS18_LandingPages_C.Button_BuyBattlePass_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BPS18_LandingPages_C_Button_BuyBattlePass_Event_0 final
{
public:
	class UBPS18_LandingPage_SmallButton_C*       Button_BuyBattlePass_0;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPS18_LandingPages.BPS18_LandingPages_C.Button_GiftBattlePass_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BPS18_LandingPages_C_Button_GiftBattlePass_Event_0 final
{
public:
	class UBPS18_LandingPage_SmallButton_C*       Button_GiftBattlePass_0;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPS18_LandingPages.BPS18_LandingPages_C.Button_BuyResources_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BPS18_LandingPages_C_Button_BuyResources_Event_0 final
{
public:
	class UBPS18_LandingPage_SmallButton_C*       Button_BuyResources_0;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPS18_LandingPages.BPS18_LandingPages_C.Button_JoinSubscription_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BPS18_LandingPages_C_Button_JoinSubscription_Event_0 final
{
public:
	class UBPS18_LandingPageButton_C*             Button_JoinSubscription_0;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPS18_LandingPages.BPS18_LandingPages_C.Button_BonusRewards_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BPS18_LandingPages_C_Button_BonusRewards_Event_0 final
{
public:
	class UBPS18_LandingPageButton_C*             Button_BonusRewards_0;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPS18_LandingPages.BPS18_LandingPages_C.Button_MysteryRewards_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BPS18_LandingPages_C_Button_MysteryRewards_Event_0 final
{
public:
	class UBPS18_LandingPageButton_C*             Button_MysteryRewards;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPS18_LandingPages.BPS18_LandingPages_C.Button_CharacterCustomizer_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BPS18_LandingPages_C_Button_CharacterCustomizer_Event_0 final
{
public:
	class UBPS18_LandingPageButton_C*             Button_CharacterCustomizer_0;                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPS18_LandingPages.BPS18_LandingPages_C.Button_RewardOverview_Event_2
// 0x0008 (0x0008 - 0x0000)
struct BPS18_LandingPages_C_Button_RewardOverview_Event_2 final
{
public:
	class UBPS18_LandingPageButton_C*             Button_RewardOverview;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPS18_LandingPages.BPS18_LandingPages_C.Play intro
// 0x0008 (0x0008 - 0x0000)
struct BPS18_LandingPages_C_Play_intro final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPS18_LandingPages.BPS18_LandingPages_C.SequenceEvent__ENTRYPOINTBPS18_LandingPages_0
// 0x0008 (0x0008 - 0x0000)
struct BPS18_LandingPages_C_SequenceEvent__ENTRYPOINTBPS18_LandingPages_0 final
{
public:
	class UBPS18_LandingPageButton_C*             Button_RewardOverview;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPS18_LandingPages.BPS18_LandingPages_C.SequenceEvent__ENTRYPOINTBPS18_LandingPages_1
// 0x0008 (0x0008 - 0x0000)
struct BPS18_LandingPages_C_SequenceEvent__ENTRYPOINTBPS18_LandingPages_1 final
{
public:
	class UBPS18_LandingPageButton_C*             Button_CharacterCustomizer_0;                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPS18_LandingPages.BPS18_LandingPages_C.SequenceEvent__ENTRYPOINTBPS18_LandingPages_2
// 0x0008 (0x0008 - 0x0000)
struct BPS18_LandingPages_C_SequenceEvent__ENTRYPOINTBPS18_LandingPages_2 final
{
public:
	class UBPS18_LandingPageButton_C*             Button_MysteryRewards;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPS18_LandingPages.BPS18_LandingPages_C.SequenceEvent__ENTRYPOINTBPS18_LandingPages_3
// 0x0008 (0x0008 - 0x0000)
struct BPS18_LandingPages_C_SequenceEvent__ENTRYPOINTBPS18_LandingPages_3 final
{
public:
	class UBPS18_LandingPageButton_C*             Button_BonusRewards_0;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPS18_LandingPages.BPS18_LandingPages_C.SequenceEvent__ENTRYPOINTBPS18_LandingPages_4
// 0x0008 (0x0008 - 0x0000)
struct BPS18_LandingPages_C_SequenceEvent__ENTRYPOINTBPS18_LandingPages_4 final
{
public:
	class UBPS18_LandingPageButton_C*             Button_JoinSubscription_0;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPS18_LandingPages.BPS18_LandingPages_C.SequenceEvent__ENTRYPOINTBPS18_LandingPages_5
// 0x0008 (0x0008 - 0x0000)
struct BPS18_LandingPages_C_SequenceEvent__ENTRYPOINTBPS18_LandingPages_5 final
{
public:
	class UBPS18_LandingPage_SmallButton_C*       Button_BuyResources_0;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPS18_LandingPages.BPS18_LandingPages_C.SequenceEvent__ENTRYPOINTBPS18_LandingPages_6
// 0x0008 (0x0008 - 0x0000)
struct BPS18_LandingPages_C_SequenceEvent__ENTRYPOINTBPS18_LandingPages_6 final
{
public:
	class UBPS18_LandingPage_SmallButton_C*       Button_GiftBattlePass_0;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPS18_LandingPages.BPS18_LandingPages_C.SequenceEvent__ENTRYPOINTBPS18_LandingPages_7
// 0x0008 (0x0008 - 0x0000)
struct BPS18_LandingPages_C_SequenceEvent__ENTRYPOINTBPS18_LandingPages_7 final
{
public:
	class UBPS18_LandingPage_SmallButton_C*       Button_BuyBattlePass_0;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

