#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DiscoveryBrowserUI

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "DiscoveryBrowserUI_structs.hpp"
#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CommonUI_classes.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_classes.hpp"
#include "CommonUILegacy_structs.hpp"
#include "CommonUILegacy_classes.hpp"


namespace SDK
{

// Class DiscoveryBrowserUI.FortActivityBrowserTabButton
// 0x0000 (0x0BF0 - 0x0BF0)
class UFortActivityBrowserTabButton final : public UFortTabButton
{
public:
	void OnFavoriteChanged(bool bIsFavorite);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserTabButton">();
	}
	static class UFortActivityBrowserTabButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserTabButton>();
	}
};

// Class DiscoveryBrowserUI.ActivityLibraryComponent
// 0x0010 (0x00C0 - 0x00B0)
class UActivityLibraryComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B0[0x10];                                      // 0x00B0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActivityLibraryComponent">();
	}
	static class UActivityLibraryComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityLibraryComponent>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowser
// 0x01D8 (0x0520 - 0x0348)
class UFortActivityBrowser final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidgetSwitcher*       Switcher_ActivityBrowserViews;                     // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Back;                                       // 0x0358(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_ShowCustomMatchmakingModal;                 // 0x0360(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_BackToTop;                                  // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_MobileShowGameDetails;                      // 0x0370(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_MobileAccept;                               // 0x0378(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_MobileClose;                                // 0x0380(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_JoinAsSpectator;                            // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_ShowSpectateMatchModal;                     // 0x0390(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortTabListWidgetBase*                 TabList_BrowserTabs;                               // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FPrimaryContentSetup                   PrimaryContentSetup;                               // 0x03A0(0x0001)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortTabButton>             TabButtonClass;                                    // 0x03A8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortActivityDetailsModal>  ActivityDetailsModalClass;                         // 0x03B0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   SoftCustomMatchmakingModalClass;                   // 0x03B8(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   SoftSpectateMatchModalClass;                       // 0x03E0(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortCreativeDiscoverySurfaceManager*   Manager;                                           // 0x0408(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortCreativeDiscoverySurface*          Surface;                                           // 0x0410(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UFortCreativeDiscoveryActivityProvider*> CachedSurfaceActivityProviders;            // 0x0418(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_428[0xF8];                                     // 0x0428(0x00F8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleTabChanged(class FName TabId);
	void OnActivitySelected();
	void OnPlayerQueueTypeChanged(const EPlayerQueueType PlayerQueueType);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowser">();
	}
	static class UFortActivityBrowser* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowser>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserListView
// 0x0150 (0x0370 - 0x0220)
class UFortActivityBrowserListView final : public UListViewBase
{
public:
	uint8                                         Pad_220[0xC0];                                     // 0x0220(0x00C0)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DirectionalNavigationTimeThreshold;                // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortActivityBrowserRow>    PromotedActivityClass;                             // 0x02E8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2F0[0x80];                                     // 0x02F0(0x0080)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserListView">();
	}
	static class UFortActivityBrowserListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserListView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserRow
// 0x0068 (0x02F0 - 0x0288)
class UFortActivityBrowserRow : public UCommonUserWidget
{
public:
	uint8                                         Pad_288[0x60];                                     // 0x0288(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_CategoryName;                                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnCategoryItemChanged(const bool bIsActive, const bool bPlayAnimation);
	void OnRowIsActiveChanged(const bool bIsActive);
	void OnRowMoveDown();
	void OnRowMoveUp();
	void OnRowPeekStateChanged(const bool bIsInPeekState);

	bool GetIsActive() const;
	bool GetIsInPeekState() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserRow">();
	}
	static class UFortActivityBrowserRow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserRow>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserRowList
// 0x0020 (0x0310 - 0x02F0)
class UFortActivityBrowserRowList final : public UFortActivityBrowserRow
{
public:
	class UFortActivityListView*                  ListView_Activities;                               // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_PageLeft;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_PageRight;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_308[0x8];                                      // 0x0308(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnQueryStatusChanged(bool bIsActive);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserRowList">();
	}
	static class UFortActivityBrowserRowList* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserRowList>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserRowPromoted
// 0x0008 (0x02F8 - 0x02F0)
class UFortActivityBrowserRowPromoted final : public UFortActivityBrowserRow
{
public:
	class UCommonTextBlock*                       Text_ActivityName;                                 // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnPreviewImageChanged(const bool bIsLoading, const class UTexture* Texture);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserRowPromoted">();
	}
	static class UFortActivityBrowserRowPromoted* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserRowPromoted>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserSoloButton
// 0x00D0 (0x0CF0 - 0x0C20)
class UFortActivityBrowserSoloButton final : public UCommonButtonLegacy
{
public:
	class FText                                   DefaultText;                                       // 0x0C20(0x0018)(Edit, NativeAccessSpecifierPrivate)
	bool                                          bUseAllCaps;                                       // 0x0C38(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bOverrideFont;                                     // 0x0C39(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C3A[0x6];                                      // 0x0C3A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         Font;                                              // 0x0C40(0x0058)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSlateColor                            FontColor;                                         // 0x0C98(0x0028)(Edit, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_Content;                                      // 0x0CC0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MinWidthOverride;                                  // 0x0CC8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MinHeightOverride;                                 // 0x0CCC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FMargin                                TextPaddingOverride;                               // 0x0CD0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	int32                                         FontSizeOverride;                                  // 0x0CE0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_CE4[0x4];                                      // 0x0CE4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     MaterialOverride;                                  // 0x0CE8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserSoloButton">();
	}
	static class UFortActivityBrowserSoloButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserSoloButton>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserTag
// 0x0010 (0x0270 - 0x0260)
class UFortActivityBrowserTag final : public UUserWidget
{
public:
	class UCommonTextBlock*                       Text_TagDescription;                               // 0x0260(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnTagUpdated();

	EFortActivityBrowserTagType GetTagType() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserTag">();
	}
	static class UFortActivityBrowserTag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserTag>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserTile
// 0x00C8 (0x0350 - 0x0288)
class UFortActivityBrowserTile final : public UCommonUserWidget
{
public:
	uint8                                         Pad_288[0x8];                                      // 0x0288(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortActivityTileDetailsDisplay*        Display_TileDetails;                               // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_298[0xB8];                                     // 0x0298(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleActivitySelected();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserTile">();
	}
	static class UFortActivityBrowserTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserTile>();
	}
};

// Class DiscoveryBrowserUI.FortActivityView
// 0x00D8 (0x0420 - 0x0348)
class UFortActivityView : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bShowCustomMatchmakingModalButton;                 // 0x0350(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bShowSpectateMatchModalButton;                     // 0x0351(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bShowMobileGameDetailsButton;                      // 0x0352(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bShowMobileAcceptButton;                           // 0x0353(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bShowBackToTopButton;                              // 0x0354(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_355[0xCB];                                     // 0x0355(0x00CB)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnLocalPlayerDemoted();
	void BP_OnLocalPlayerPromotedToLeader();
	void BP_OnPartySizeChanged(const int32 PartySize);
	void OnSurfaceDataDirty();

	EFortInvalidActivityReason GetInvalidActivityReason() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityView">();
	}
	static class UFortActivityView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserView
// 0x0170 (0x0590 - 0x0420)
class UFortActivityBrowserView final : public UFortActivityView
{
public:
	uint8                                         Pad_420[0x8];                                      // 0x0420(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MouseWheelScrollTimeThreshold;                     // 0x0428(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         ActivityMovieBlacklist;                            // 0x0430(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	TArray<ECommonPlatformType>                   PlatformMovieBlacklist;                            // 0x0440(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	class FName                                   TabNameID;                                         // 0x0450(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFortTabButtonLabelInfo                TabButtonLabelInfo;                                // 0x0458(0x00A0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	bool                                          bPlayDetailsAnimationOnScreenOpen;                 // 0x04F8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4F9[0x7];                                      // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortActivatableMovieWidget> MovieWidgetClass;                                 // 0x0500(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSwipePanel*                        SwipePanel_Navigation;                             // 0x0508(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityDetailsDisplay*            DetailsDisplay_SelectedActivity;                   // 0x0510(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityDetailsDisplay*            DetailsDisplay_PromotedActivity;                   // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityBrowserListView*           BrowserList_Activities;                            // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                           Panel_VideoSlot;                                   // 0x0528(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivatableMovieWidget*            ActivityMovieWidget;                               // 0x0530(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_538[0x58];                                     // 0x0538(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleMovieWidgetMediaStarted();
	void OnActivityUpdated();
	void OnMoviePlayingChanged(const bool bIsPlaying);
	void OnPreviewImageChanged(const bool bIsLoading, const class UTexture* Texture);
	void OnQueryActivitiesFinished();
	void OnRowChanged(const int32 NewCategoryIndex);

	bool IsShowingPromotedContent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserView">();
	}
	static class UFortActivityBrowserView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityCreateView
// 0x00C8 (0x04E8 - 0x0420)
class UFortActivityCreateView final : public UFortActivityView
{
public:
	uint8                                         Pad_420[0x8];                                      // 0x0420(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TabNameID;                                         // 0x0428(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFortTabButtonLabelInfo                TabButtonLabelInfo;                                // 0x0430(0x00A0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Create;                                     // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4D8[0x10];                                     // 0x04D8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	EFortInvalidActivityReason GetInvalidCreativeActivityReason() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityCreateView">();
	}
	static class UFortActivityCreateView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityCreateView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityDetailsDisplay
// 0x00D0 (0x0358 - 0x0288)
class UFortActivityDetailsDisplay final : public UCommonUserWidget
{
public:
	uint8                                         Pad_288[0x60];                                     // 0x0288(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         XpTagMnemonicWhitelist;                            // 0x02E8(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	float                                         IntroDelay;                                        // 0x02F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DetailsScrollStartDelay;                           // 0x02FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DetailsScrollSpeed;                                // 0x0300(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DetailsScrollEndDelay;                             // 0x0304(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   Text_ActivityOrigin;                               // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ActivityName;                                 // 0x0310(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ActivityDescription;                          // 0x0318(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScrollBox*                             ScrollBox_ActivityDescription;                     // 0x0320(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                       EntryBox_ActivityTags;                             // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                       DetailsIntro;                                      // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                       DetailsOutro;                                      // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Accept;                                     // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Details;                                    // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Favorite;                                   // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class FText GetCreatorTextFormat(const class FText& CreatorName);
	void OnDescriptionScrollRestarted();
	void OnDetailsUpdated(const bool bIsDetailsValid);
	void OnIsFavoriteChanged(const bool bIsFavorite, const bool bPlayAnimation);
	void OnLocalPlayerDemoted();
	void OnLocalPlayerPromotedToLeader();
	void OnOutroAnimationFinished();
	void OnParentActivated();
	void OnPartySizeChanged(const int32 PartySize);
	void ResetWidgetState();

	TArray<class FString> GetContentWarningStrings() const;
	EFortInvalidActivityReason GetInvalidActivityReason() const;
	bool IsActivityEpicOriginal() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityDetailsDisplay">();
	}
	static class UFortActivityDetailsDisplay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityDetailsDisplay>();
	}
};

// Class DiscoveryBrowserUI.FortActivityDetailsModal
// 0x0058 (0x0478 - 0x0420)
class UFortActivityDetailsModal final : public UFortActivityView
{
public:
	class UCommonTextBlock*                       Text_LinkCode;                                     // 0x0420(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_LinkCodeVersion;                              // 0x0428(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityDetailsDisplay*            DetailsDisplay_SelectedActivity;                   // 0x0430(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_MobileClose;                                // 0x0438(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Back;                                       // 0x0440(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_BackBoard;                                  // 0x0448(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Favorite;                                   // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_458[0x20];                                     // 0x0458(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnIsFavoriteChanged(const bool bIsFavorite);
	void OnPreviewImageChanged(const bool bIsLoading, const class UTexture* Texture);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityDetailsModal">();
	}
	static class UFortActivityDetailsModal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityDetailsModal>();
	}
};

// Class DiscoveryBrowserUI.FortActivityEllipsisTextBlock
// 0x0030 (0x0290 - 0x0260)
class UFortActivityEllipsisTextBlock final : public UUserWidget
{
public:
	class UWidget*                                Widget_ClippingArea;                               // 0x0260(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_Text;                                         // 0x0268(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Widget_MoreTextIndicator;                          // 0x0270(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_278[0x18];                                     // 0x0278(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityEllipsisTextBlock">();
	}
	static class UFortActivityEllipsisTextBlock* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityEllipsisTextBlock>();
	}
};

// Class DiscoveryBrowserUI.FortActivityPlayerBrowserView
// 0x00F0 (0x0510 - 0x0420)
class UFortActivityPlayerBrowserView : public UFortActivityView
{
public:
	uint8                                         Pad_420[0x8];                                      // 0x0420(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameActivityProvider*              ActivityProvider;                                  // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   TabNameID;                                         // 0x0430(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFortTabButtonLabelInfo                TabButtonLabelInfo;                                // 0x0438(0x00A0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	EFortCreativeDiscoveryPlayHistoryType         PlayHistoryProviderType;                           // 0x04D8(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4D9[0x7];                                      // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortGameActivityProvider>  ActivityProviderClass;                             // 0x04E0(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityTileView*                  TileView_PlayerActivities;                         // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4F0[0x20];                                     // 0x04F0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnTileViewUpdated();
	void OnPlayViewIntro();
	void PlayViewIntro();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityPlayerBrowserView">();
	}
	static class UFortActivityPlayerBrowserView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityPlayerBrowserView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityFavoriteBrowserView
// 0x0050 (0x0560 - 0x0510)
class UFortActivityFavoriteBrowserView final : public UFortActivityPlayerBrowserView
{
public:
	uint8                                         Pad_510[0x50];                                     // 0x0510(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityFavoriteBrowserView">();
	}
	static class UFortActivityFavoriteBrowserView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityFavoriteBrowserView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityListItemWrapper
// 0x0010 (0x0038 - 0x0028)
class UFortActivityListItemWrapper final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityListItemWrapper">();
	}
	static class UFortActivityListItemWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityListItemWrapper>();
	}
};

// Class DiscoveryBrowserUI.FortActivityListView
// 0x00F0 (0x0310 - 0x0220)
class UFortActivityListView final : public UListViewBase
{
public:
	uint8                                         Pad_220[0xC0];                                     // 0x0220(0x00C0)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DirectionalNavigationTimeThreshold;                // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOrientation                                  Orientation;                                       // 0x02E4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E5[0x3];                                      // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EntrySpacing;                                      // 0x02E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2EC[0x24];                                     // 0x02EC(0x0024)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 GetInViewCount() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityListView">();
	}
	static class UFortActivityListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityListView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityLobbyTile
// 0x0038 (0x0C58 - 0x0C20)
class UFortActivityLobbyTile : public UCommonButtonLegacy
{
public:
	class UCommonTextBlock*                       Text_ActivityName;                                 // 0x0C20(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityBrowserTag*                ActivityBrowserTag_EpicOriginal;                   // 0x0C28(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortGameActivityProvider*              ActivityProvider;                                  // 0x0C30(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C38[0x20];                                     // 0x0C38(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnDetailsUpdated();
	void OnPreviewImageChanged(const bool bIsLoading, const class UTexture* Texture);

	bool IsActivityEpicCreated() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityLobbyTile">();
	}
	static class UFortActivityLobbyTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityLobbyTile>();
	}
};

// Class DiscoveryBrowserUI.FortActivityPlayerBrowserTile
// 0x00D0 (0x0358 - 0x0288)
class UFortActivityPlayerBrowserTile final : public UCommonUserWidget
{
public:
	uint8                                         Pad_288[0x8];                                      // 0x0288(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortActivityTileDetailsDisplay*        Display_TileDetails;                               // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_LastPlayedDate;                               // 0x0298(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A0[0xB8];                                     // 0x02A0(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleActivitySelected();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityPlayerBrowserTile">();
	}
	static class UFortActivityPlayerBrowserTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityPlayerBrowserTile>();
	}
};

// Class DiscoveryBrowserUI.FortActivityPlayerView
// 0x00F0 (0x0510 - 0x0420)
class UFortActivityPlayerView final : public UFortActivityView
{
public:
	uint8                                         Pad_420[0x8];                                      // 0x0420(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TabNameID;                                         // 0x0428(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFortTabButtonLabelInfo                TabButtonLabelInfo;                                // 0x0430(0x00A0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TSubclassOf<class UCommonButtonBase>          TabButtonClass;                                    // 0x04D0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortTabListWidgetBase*                 TabList_PlayerViewTabs;                            // 0x04D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonActivatableWidgetSwitcher*       Switcher_PlayerBrowserViews;                       // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityPlayerBrowserView*         BrowserView_Favorites;                             // 0x04E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityPlayerBrowserView*         BrowserView_History;                               // 0x04F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4F8[0x18];                                     // 0x04F8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityPlayerView">();
	}
	static class UFortActivityPlayerView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityPlayerView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityPlayerViewTabButton
// 0x0008 (0x0BF8 - 0x0BF0)
class UFortActivityPlayerViewTabButton final : public UFortTabButton
{
public:
	class UCommonTextBlock*                       Text_Count;                                        // 0x0BF0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityPlayerViewTabButton">();
	}
	static class UFortActivityPlayerViewTabButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityPlayerViewTabButton>();
	}
};

// Class DiscoveryBrowserUI.FortActivityScaleFontList
// 0x0010 (0x0038 - 0x0028)
class UFortActivityScaleFontList final : public UObject
{
public:
	TArray<struct FFortActivityScaleFontData>     ScaleData;                                         // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityScaleFontList">();
	}
	static class UFortActivityScaleFontList* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityScaleFontList>();
	}
};

// Class DiscoveryBrowserUI.FortActivityScalingTextBlock
// 0x0008 (0x02D8 - 0x02D0)
class UFortActivityScalingTextBlock final : public UCommonTextBlock
{
public:
	TSubclassOf<class UFortActivityScaleFontList> Scaling;                                           // 0x02D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityScalingTextBlock">();
	}
	static class UFortActivityScalingTextBlock* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityScalingTextBlock>();
	}
};

// Class DiscoveryBrowserUI.FortActivitySearchView
// 0x0100 (0x0520 - 0x0420)
class UFortActivitySearchView final : public UFortActivityView
{
public:
	uint8                                         Pad_420[0x8];                                      // 0x0420(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TabNameID;                                         // 0x0428(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFortTabButtonLabelInfo                TabButtonLabelInfo;                                // 0x0430(0x00A0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UEditableText*                          EditableText_IslandLink;                           // 0x04D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4D8[0x48];                                     // 0x04D8(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleTextChanged(const class FText& Text);
	void HandleTextCommitted(const class FText& InText, ETextCommit CommitInfo);
	void OnActivityClear();
	void OnActivityValidated(const EFortActivityValidationResult ValidateResult);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivitySearchView">();
	}
	static class UFortActivitySearchView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivitySearchView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityTileDetailsDisplay
// 0x00B0 (0x0C80 - 0x0BD0)
class UFortActivityTileDetailsDisplay final : public UCommonButtonBase
{
public:
	TMulticastInlineDelegate<void()>              OnActivitySelectedDelegate;                        // 0x0BD0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              OnActivityUnSelectedDelegate;                      // 0x0BE0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	bool                                          bShowDetailsButton;                                // 0x0BF0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_BF1[0x7];                                      // 0x0BF1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortActivityEllipsisTextBlock*         Text_ActivityName;                                 // 0x0BF8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_PlayerCount;                                  // 0x0C00(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Favorite;                                   // 0x0C08(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Details;                                    // 0x0C10(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityBrowserTag*                ActivityBrowserTag_EpicOriginal;                   // 0x0C18(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C20[0x60];                                     // 0x0C20(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnDetailsUpdated();
	void OnIsFavoriteChanged(const bool bIsFavorite);
	void OnLocalPlayerDemoted();
	void OnLocalPlayerPromotedToLeader();
	void OnPartySizeChanged(const int32 PartySize);
	void OnPreviewImageChanged(const bool bIsLoading, const class UTexture* Texture);
	void OnSocialUsersPlayingChanged(int32 NumPlaying);
	void OnTileActiveSet(const bool bIsTileActive);

	EFortInvalidActivityReason GetInvalidActivityReason() const;
	bool IsActivityEpicCreated() const;
	bool IsActivityFavorited() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityTileDetailsDisplay">();
	}
	static class UFortActivityTileDetailsDisplay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityTileDetailsDisplay>();
	}
};

// Class DiscoveryBrowserUI.FortActivityTileView
// 0x0000 (0x0860 - 0x0860)
class UFortActivityTileView final : public UTileView
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityTileView">();
	}
	static class UFortActivityTileView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityTileView>();
	}
};

// Class DiscoveryBrowserUI.OverrideMatchmakingUIComponent
// 0x0050 (0x0100 - 0x00B0)
class UOverrideMatchmakingUIComponent : public UActorComponent
{
public:
	struct FMatchmakingUIOverride                 MatchmakingUIOverride;                             // 0x00B0(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OverrideMatchmakingUIComponent">();
	}
	static class UOverrideMatchmakingUIComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOverrideMatchmakingUIComponent>();
	}
};

}

