#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Events_AudioAnalysis_Stem_Component

#include "Basic.hpp"

#include "Events_AudioAnalysis_Stem_Type_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Events_AudioAnalysis_Stem_Component.Events_AudioAnalysis_Stem_Component_C
// 0x0040 (0x00F0 - 0x00B0)
class UEvents_AudioAnalysis_Stem_Component_C final : public UActorComponent
{
public:
	class UAudioSynesthesiaNRT*                   NRT;                                               // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Events_AudioAnalysis_Stem_Type                Type;                                              // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NRTLoudness;                                       // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NRTOnsetDetected;                                  // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeLastOnsetDetected;                             // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 NRTConstantQ;                                      // 0x00C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   ParameterName;                                     // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialParameterCollection*           MaterialPC;                                        // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScalarValue;                                       // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MappedTimeVar;                                     // 0x00EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Update(float Time);
	void UpdateLoudness(const float InSeconds);
	void UpdateOnset(float InputPin);
	void UpdateConstantQ(const float InSeconds);
	void PostUpdate();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Events_AudioAnalysis_Stem_Component_C">();
	}
	static class UEvents_AudioAnalysis_Stem_Component_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEvents_AudioAnalysis_Stem_Component_C>();
	}
};

}

