#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GuavaRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GuavaRuntime.BuildingGameplayActorGuavaEnemy.IsCriticalHit
// 0x008C (0x008C - 0x0000)
struct BuildingGameplayActorGuavaEnemy_IsCriticalHit final
{
public:
	struct FHitResult                             HitResult;                                         // 0x0000(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0088(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GuavaRuntime.BuildingGameplayActorGuavaCaretaker.GetCapsuleComponent
// 0x0008 (0x0008 - 0x0000)
struct BuildingGameplayActorGuavaCaretaker_GetCapsuleComponent final
{
public:
	class UCapsuleComponent*                      ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GuavaRuntime.BuildingGameplayActorGuavaCaretaker.GetCurrentPathDistance
// 0x0004 (0x0004 - 0x0000)
struct BuildingGameplayActorGuavaCaretaker_GetCurrentPathDistance final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GuavaRuntime.BuildingGameplayActorGuavaCaretaker.GetCurrentSpeed
// 0x0004 (0x0004 - 0x0000)
struct BuildingGameplayActorGuavaCaretaker_GetCurrentSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GuavaRuntime.BuildingGameplayActorGuavaCaretaker.GetSkeletalMeshComponent
// 0x0008 (0x0008 - 0x0000)
struct BuildingGameplayActorGuavaCaretaker_GetSkeletalMeshComponent final
{
public:
	class USkeletalMeshComponent*                 ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GuavaRuntime.BuildingGameplayActorGuavaCaretaker.GetWalkPlayRateAndSpeedWarpingValues
// 0x0008 (0x0008 - 0x0000)
struct BuildingGameplayActorGuavaCaretaker_GetWalkPlayRateAndSpeedWarpingValues final
{
public:
	float                                         OutWalkPlayRateValue;                              // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutWalkSpeedWarpingValue;                          // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

