#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HermesPlaysetsUI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CommonUI_classes.hpp"
#include "HermesPlaysetsUI_structs.hpp"
#include "DynamicHUD_classes.hpp"


namespace SDK
{

// Class HermesPlaysetsUI.DownloadEntryScreen
// 0x0040 (0x0388 - 0x0348)
class UDownloadEntryScreen final : public UCommonActivatableWidget
{
public:
	TMulticastInlineDelegate<void(const class FString& DowloadLinkCode)> OnDownloadLinkCodeConfirmed; // 0x0348(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnEditableTextDownloadLinkCodeModified;            // 0x0358(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UUserWidget*                            DownloadWidget;                                    // 0x0368(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEditableText*                          EditableText_DownloadLinkCode;                     // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 LastTestedMnemonic;                                // 0x0378(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleDownloadLinkCodeChanged(const class FText& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadEntryScreen">();
	}
	static class UDownloadEntryScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadEntryScreen>();
	}
};

// Class HermesPlaysetsUI.DownloadOnDemandDirector
// 0x0570 (0x07A0 - 0x0230)
class ADownloadOnDemandDirector final : public ADynamicHUDDirectorBase
{
public:
	class FString                                 CurrentDownloadLinkCode;                           // 0x0230(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CurrentMetaDataGatheringLinkcode;                  // 0x0240(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBeaconDisconnected;                               // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_251[0x17];                                     // 0x0251(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAssetData>                     DownloadAssetData;                                 // 0x0268(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_278[0x60];                                     // 0x0278(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortItemDefinition*>            DownloadProjectDefinitions;                        // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E8[0x8];                                      // 0x02E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               CreativeItemListMenuWidget;                        // 0x02F0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F8[0x148];                                    // 0x02F8(0x0148)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, struct FModuleData>       ModuleToDownloadedItems;                           // 0x0440(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_490[0x290];                                    // 0x0490(0x0290)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class UTexture2DDynamic*> LinkCodeToPreviewTexture2D;                        // 0x0720(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_770[0x30];                                     // 0x0770(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BroadcastDownloadOnDemandShowErrorMessage();
	bool CanAddProject();
	bool CanRemoveProject();
	bool CanShowRemoveButton();
	void HandlePlaysetDownloadedSuccess(bool bSuccess);
	void HermesPlaysetDownloadedOnServer(const class FString& InLinkCode, bool bSuccess, const class FString& ErrorMessage);
	void HermesPlaysetLinkCodeResolved(const class FString& InLinkCode, const class FString& InProjectId, bool bSuccess);
	bool IsUsingDynamicHUDForUI();
	void LinkCodeMetaDataLoaded(const class FString& InLinkCode, const class FString& InProjectId, const class FString& InTitleString);
	void LinkCodeMetaDataPreviewTextureLoaded(class UTexture2DDynamic* InPreviewTexture);
	bool LoadLinkCodeMetaData(const class FString& InLinkCode, const class FString& InProjectId, class AFortPlayerControllerAthena* InFortPlayerControllerAthena);
	void OnLinkPreviewImageDownloaded(bool bSuccess, class UTexture2DDynamic* InPreviewTexture);
	void OnNewLinkCodeChanged(const TArray<class FString>& UpdatedLinkCodes);
	bool RequestLinkCodePreviewFromCode(const class FString& InCode, class AFortPlayerControllerAthena* InFortPlayerControllerAthena);
	bool RequestPlaysetFromCode(const class FString& InCode, const class FString& InProjectId, const class FString& InTitleName, class AFortPlayerControllerAthena* InFortPlayerControllerAthena);
	void ReturnToFrontEnd();
	void ShowDownloadOnDemandError(EDownloadOnDemandErrorMessage DownloadOnDemandErrorMessage, const class FString& InLinkCode, const class FString& ErrorMessage);
	class UCommonActivatableWidget* ShowDownloadOnDemandModal(class UCommonActivatableWidget* ParentWidget);
	class UCommonActivatableWidget* ShowErrorMessageModal(class UCommonActivatableWidget* ParentWidget);

	bool CanAddLinkCode(const class FString& InLinkCode) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandDirector">();
	}
	static class ADownloadOnDemandDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADownloadOnDemandDirector>();
	}
};

}

