#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HitchhikerRuntime

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class HitchhikerRuntime.FortHitchhikerComponent_Telemetry
// 0x0010 (0x0118 - 0x0108)
class UFortHitchhikerComponent_Telemetry final : public UFortAIComponent_Telemetry
{
public:
	bool                                          bWasInfectedAtSpawn;                               // 0x0108(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InfectionCount;                                    // 0x010C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         DeinfectionCount;                                  // 0x0110(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnDeinfected();
	void OnInfected();
	void SetWasInfectedAtSpawn(bool bInfectedAtSpawn);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortHitchhikerComponent_Telemetry">();
	}
	static class UFortHitchhikerComponent_Telemetry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortHitchhikerComponent_Telemetry>();
	}
};

}

