#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pickaxe_Gnome_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Pickaxe_Gnome_AnimBlueprint.Pickaxe_Gnome_AnimBlueprint_C
// 0x0920 (0x0E30 - 0x0510)
class UPickaxe_Gnome_AnimBlueprint_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0518(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x0548(0x0118)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0660(0x0790)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0DF0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0E10(0x0020)()

public:
	void ExecuteUbergraph_Pickaxe_Gnome_AnimBlueprint(int32 EntryPoint);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Pickaxe_Gnome_AnimBlueprint_C">();
	}
	static class UPickaxe_Gnome_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPickaxe_Gnome_AnimBlueprint_C>();
	}
};

}

