#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerSidewaysComponent

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "SidewaysCodeRuntime_structs.hpp"
#include "SidewaysCodeRuntime_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PlayerSidewaysComponent.PlayerSidewaysComponent_C
// 0x0068 (0x01A0 - 0x0138)
class UPlayerSidewaysComponent_C final : public USidewaysStateComponent_Player
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0138(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTagContainer                  T_InsideSideways;                                  // 0x0140(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSubclassOf<class UGameplayEffect>            GE_InsideSideways;                                 // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            GE_Lowgrav;                                        // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayTagContainer                  T_SidewaysLowGrav;                                 // 0x0170(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           WaitForValidAbilitySystemHandle;                   // 0x0190(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	ESidewaysState                                CachedNewState;                                    // 0x0198(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PlayerSidewaysComponent(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void WaitForValidAbilitySystem();
	void HandleSidewaysStateChanged(class ASidewaysPlayspace* NewSidewaysPlayspace, ESidewaysState OldState, ESidewaysState NewState);
	void UpdateGameplayAbilities(class UFortAbilitySystemComponent* AbilitySystemComponent, ESidewaysState SidewaysState_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerSidewaysComponent_C">();
	}
	static class UPlayerSidewaysComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerSidewaysComponent_C>();
	}
};

}

