#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProgressiveCosmeticUI

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function ProgressiveCosmeticUI.FortProgressiveItemWidget.OnPeekStateChanged
// 0x0001 (0x0001 - 0x0000)
struct FortProgressiveItemWidget_OnPeekStateChanged final
{
public:
	bool                                          bIsInPeekState;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ProgressiveCosmeticUI.FortProgressiveItemWidget.OnStageItemChanged
// 0x0040 (0x0040 - 0x0000)
struct FortProgressiveItemWidget_OnStageItemChanged final
{
public:
	struct FProgressiveStageItemInfo              InStageItemInfo;                                   // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function ProgressiveCosmeticUI.FortProgressiveStageList.AddStageWidget
// 0x0008 (0x0008 - 0x0000)
struct FortProgressiveStageList_AddStageWidget final
{
public:
	class UFortProgressiveStageWidget*            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ProgressiveCosmeticUI.FortProgressiveStageWidget.AddStageItemWidget
// 0x0008 (0x0008 - 0x0000)
struct FortProgressiveStageWidget_AddStageItemWidget final
{
public:
	class UFortProgressiveItemWidget*             ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ProgressiveCosmeticUI.FortProgressiveStageWidget.OnPeekStateChanged
// 0x0001 (0x0001 - 0x0000)
struct FortProgressiveStageWidget_OnPeekStateChanged final
{
public:
	bool                                          bIsInPeekState;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

