#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SmartObjectsModule

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum SmartObjectsModule.ESmartObjectSlotState
// NumValues: 0x0004
enum class ESmartObjectSlotState : uint8
{
	Free                                     = 0,
	Claimed                                  = 1,
	Occupied                                 = 2,
	MAX                                      = 3,
};

// ScriptStruct SmartObjectsModule.SmartObjectID
// 0x0004 (0x0004 - 0x0000)
struct FSmartObjectID final
{
public:
	uint32                                        ID;                                                // 0x0000(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct SmartObjectsModule.SmartObjectCollectionEntry
// 0x0020 (0x0020 - 0x0000)
struct FSmartObjectCollectionEntry final
{
public:
	struct FSmartObjectID                         ID;                                                // 0x0000(0x0004)(Edit, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        Path;                                              // 0x0008(0x0018)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};

// ScriptStruct SmartObjectsModule.SmartObjectSlot
// 0x0070 (0x0070 - 0x0000)
struct FSmartObjectSlot final
{
public:
	struct FGameplayTagQuery                      UserTagFilter;                                     // 0x0000(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FVector                                Offset;                                            // 0x0048(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Direction;                                         // 0x0054(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USmartObjectBehaviorConfigBase*> BehaviorConfigurations;                            // 0x0060(0x0010)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// ScriptStruct SmartObjectsModule.SmartObjectConfig
// 0x00D0 (0x00D0 - 0x0000)
struct FSmartObjectConfig final
{
public:
	TArray<struct FSmartObjectSlot>               Slots;                                             // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class USmartObjectBehaviorConfigBase*> DefaultBehaviorConfigurations;                     // 0x0010(0x0010)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FGameplayTagQuery                      UserTagFilter;                                     // 0x0020(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTagQuery                      ObjectTagFilter;                                   // 0x0068(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  ActivityTags;                                      // 0x00B0(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
};

// ScriptStruct SmartObjectsModule.SmartObjectSlotIndex
// 0x0004 (0x0004 - 0x0000)
struct FSmartObjectSlotIndex final
{
public:
	int32                                         Index;                                             // 0x0000(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct SmartObjectsModule.SmartObjectSlotRuntimeData
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FSmartObjectSlotRuntimeData final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SmartObjectsModule.SmartObjectRuntime
// 0x0170 (0x0170 - 0x0000)
struct alignas(0x10) FSmartObjectRuntime final
{
public:
	TArray<struct FSmartObjectSlotRuntimeData>    SlotsRuntimeData;                                  // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_10[0x160];                                     // 0x0010(0x0160)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SmartObjectsModule.SmartObjectClaimHandle
// 0x000C (0x000C - 0x0000)
struct FSmartObjectClaimHandle final
{
public:
	struct FSmartObjectID                         SmartObjectID;                                     // 0x0000(0x0004)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSmartObjectSlotIndex                  SlotIndex;                                         // 0x0004(0x0004)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x4];                                        // 0x0008(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

